package helper

import (
	"fmt"
	"testing"
)

//50us
func BenchmarkParseText(b *testing.B) {
	t6 := `#hi #666 this is #one #we all like #At_Iran8 #من_را  888dsa sd

    for th e thing in #tag1

    jlk  #ایرانی
    5445
    #😫 #😩😤 😠 😡 😶 #ol😐
    `

	t7 := `معلول کیست؟ چه بیماری ها و ناراحتی هایی معلولیت شناخته می شود؟

الف ـ قانون:

        معلول به كسي اطلاق مي‌گردد كه به تشخيص كميسيون پزشكي سازمان بهزيستي براثر ضايعه جسمي، ذهني، رواني يا توأم، اختلال مستمر و قابل توجهي در سلامت و كارآئي عمومي وي ايجاد گردد، بطوري كه موجب كاهش استقلال فرد در زمينه اجتماعي و اقتصادي شود، لذا در راستاي ماده 6 قانون جامع حمايت از حقوق معلولان بشرح زير از انجام خدمت دوره ضرورت معاف مي‌گردد:

        (1) يكي از فرزندان اوليائي كه خود معلول بوده (هر دو يا يكي از آنها معلول باشد) و يا حداقل دو نفر از فرزندان آنها معلول باشد از انجام خدمت دوره ضرورت معاف مي‌گردد.
        (2) همسراني كه زن معلول خود را سرپرستي مي‌نمايند مادامي كه سرپرستي همسر معلول را برعهده داشته باشند از انجام خدمت دوره ضرورت معاف مي‌گردند.

        ب ـ نحوه اجراء‌‌‌:

        1) معلوليت در شش گروه اصلي زير تقسيم مي‌گردد:
        الف) معلوليت جسمي حركتي.
        ب) معلوليت ذهني.
        ج) معلوليت بينائي.
        د) معلوليت شنوائي.
        هـ) معلوليت گفتاري.
        و) معلوليت بيماران رواني مزمن.

        2) درصد معلوليت در هر گروه براساس درجه بندي رتبه‌‌اي بوده و در چهار سطح زير مي‌باشد:

        الف ـ خفيف          ب‌: متوسط          ج: شديد            د: خيلي شديد

        3) نقص عضو و معلوليت به تنهايي موجب معافيت از خدمت نبوده بلكه عدم كارآيي و نياز به مراقب به دليل نقص عضو ملاك اصلي معافيت مي‌باشد. 

        4) گروه‌بندي، درجه‌بندي و تعيين ميزان درصد معلوليت افراد به عهده كميسيون پزشكي سازمان بهزيستي مستقر در شهرستانهاي سراسر كشور كه مطابق دستورالعمل شماره 6608/800/10 مورخ 20/5/1383 كه از افراد زير تشكيل مي‌گردد، مي‌باشد:

        الف‌: 1نفر پزشك متخصص وزارت بهداشت.

        ب) 2نفر پزشك متخصص سازمان بهزيستي.
        ج) 1نفر پزشك متخصص سازمان نظام پزشكي كشور.
        د) مسئول توان بخشي بهزيستي شهرستان.
        هـ) 1نفر روانشناس.
        و) 1نفر كارشناس توانبخشي.

        تبصره: كميسيون پزشكي با توجه به مدارك و مستندات و معاينات دقيق گروه، درجه و درصد معلوليت فرد را بشرح فرم پيوست اعلام مي‌نمايد.

        5) تشخيص عدم كارآيي و نياز به مراقبت و در نهايت معافيت از انجام خدمت دوره ضرورت، برعهده شوراي پزشكي حوزه‌هاي وظيفه عمومي ناجا مي‌باشد كه به موجب قانون وظيفه عمومي در شهرستانها تشكيل مي‌شود.
        6) مصاديق معلوليت كه مي‌توانند در شمول مقررات قرار گرفته و با احراز عدم كارايي و نياز به مراقب از سوي شوراي پزشكي حوزه‌هاي وظيفه موجب معافيت گردد بشرح زير اعلام مي‌گردد:

        الف) گروه اول: معلولين جسمي حركتي:

        بخش‌1: قطعي اندام‌:        (1) قطع دو پا از زير زانو و بالاتر.
        (2) قطع يك پا از بالاتر زانو.
        (3) قطع دو دست از آرنج و بالاتر.
        (4) كليه قطع عضوهائي كه از مواد فوق شديدتر باشند.
        بخش‌2: دفورميتي‌ها‌:        الف) انحرافات ستون فقرات شامل:        (1) اسكوليوز شديد و خيلي شديد غيراصلاحي (ساختاري).
        (2) كيفوز شديد و خيلي شديد غير اصلاحي (ساختاري).
        (3) فيوژنهاي شديد و خيلي‌شديد و وسيع ستون‌فقرات‌كه منجر به‌عدم‌كارائي آن گردد.
        ب) دفورميتي‌هاي اندام‌:
        (1) تغيير شكلهاي شديد و خيلي شديد و هر دو پا.
        (2) تغيير شكلهاي شديد و خيلي شديد هر دو دست.
        (3) تغيير شكلهاي شديد و خيلي شديد كامل يك اندام (فوقاني يا تحتاتي).
        (4) تغيير شكلهاي شديدتر از موارد مذكور.
        بخش3: شكستگي‌ها و دررفتگي‌ها‌:        (1) شكستگي‌هاي شديد و خيلي شديدي كه منجر به عدم كارآئي هر دو پا گردد.
        (2) شكستگي‌هاي شديد و خيلي شديدي كه منجر به عدم كارآئي هر دو دست گردد.
        (3) شكستگي‌هاي شديد و خيلي شديدي كه منجر به اختلال شديد در عملكرد ستوان فقرات گردد.
        (4) در رفتگي‌هاي شديد و خيلي شديد در اندام (فوقاني و يا تحتاني و توأم) كه منجر به عدم كارآئي حداقل دو عضو گردد.
        بخش‌4: اختلالات عضلاني‌:        كليه اختلالات و بيماريهاي اكتسابي و غيراكتسابي كه منجر به عدم كارائي حداقل يك اندام كامل (از اندام فوقاني و تحتاني) گردد.
        بخش‌5: اختلالات سيستم اعصاب مركزي و محيطي:        اختلال سيستم اعصاب مركزي:
        (1) ضايعات مغزي.
        (2) اختلالات مخچه‌اي و پايه‌هاي مغزي.
        (3) ضايعه نخاعي:
        (1/3) آنسفاليت.
        (2/3) اختلالات اكستراپير اميدال مزمن.
        (3/3) هيدروسفالي.
        (4/3) ميكروسفالي.
        (5/4) ماكروسفالي.
        (6/4) انواع ضايعات عروقي مغزي.
        (7/4) مولتي پپل اسكلروزيس (MS).
        (4/4) انواع پلژيها (منوپلژي، همي پلژي، كوادري پلژي، پاراپلژي).
        (9/4) انواع پارزيهاي شديد و خيلي شديد (همي پارزي، كوادري پارزي، پاراپارزي).
        (10/4) انواع پلي نوريتها.
        (11/4) انواع اختلالات اعصاب محيطي.
        (12/4) انواع نورو فيبرو ماتوزها.
        (13/4) انواع تومورها.
        تبصره‌: كليه اختلالات فوق مشروط به اينكه حداقل كارآئي يك اندام را بطور كامل مختل نموده و موجب اختلال در عملكرد افراد شود به نحوي كه به تشخيص كميسيون پزشكي نياز به مراقبت داشته باشد.
        ب) گروه دوم: معلوليت ذهني:
        بخش اول: معلولين ذهني با بهره هوشي زير55.
        بخش دوم: معلـولين ذهنـي با بهره‌هوشي بين 75ـ 55 كه داراي معلوليتهـاي تركيبي ديگر بوده و يا داراي ناآرامي يا تشنج غير قابل كنترل يا صرع باشد.
        ج) گروه سوم: معلوليت بينائي:
        بخش اول: اختلال در ديد و چشم، ديد كمتر از 5%  
        بخش دوم: اختلال در ميدان بينائي هر دو چشم، ميدان بينائي كمتر از 20.
        بخش سوم: نابينائي مطلق.
        بخش چهارم: تخليه هر دو چشم.
        د) گروه چهارم: معلوليت شنوائي:        بخش1: اختلال شنوائي هر دو گوش از 56 دسي‌بل به بالا.
        بخش2: ناشنوائي مطلق.
        هـ) گروه پنجم: معلوليت گفتاري:        بخش1: اختلال در گفتار، اختلال در توليد آوا و لكنت شديد.
        بخش2: زبان پريشي.
        و) گروه ششم: معلوليت بيماران رواني مزمن:        كليه بيماران‌رواني‌كه به‌تشخيص‌كميسيون‌پزشكي‌مزمن‌شده و به‌درمان پاسخ نمي‌دهند.
        7) افرادي كه داراي چند معلوليتي باشند، معلوليت بارز آنان مدنظر قرار گرفته و در تعيين درصد معلوليت در يك گروه بالاتر قرار خواهندگرفت.
        8) در مواردي‌كه در اين دستورالعمل به‌آن‌اشاره مستقيم نشده‌است درصورتي‌كه موجب عدم‌كارآئي حداقل يك اندام‌كامل فوقاني و تحتاني‌موجب اختلال‌در عملكرد فردگردد و به تشخيص‌كميسيون‌پزشكي‌نياز به‌مراقبت‌داشته‌باشند مشمول‌اين‌دستورالعمل‌قرار خواهدگرفت.
        ج: وظايف و مسئوليت‌ها:        1ـ سازمان بهزيستي:         (الف) معرفي افراد واجد شرايط جهت دريافت كارت معافيت از انجام خدمت دوره ضرورت به وظيفه عمومي.
        تبصره ـ سازمان بهزيستي مي‌تواند مسئوليت معرفي افراد واجد شرايط را به ادارات بهزيستي استانها تفويض نمايد كه در اين صورت بايستي اسامي و نمونه امضاي افراد صاحب امضاء را به معاونت وظيفه عمومي ارسال نمايد.
        (ب) ارسال روگرفت مدارك زير به وظيفه عمومي همراه با فرم معرفي‌نامه:
        1ـ روگرفت رأي كميسيون پزشكي سازمان بهزيستي مبني بر تعيين و نوع ازكارافتادگي و معلوليت فرد.
        2ـ روگرفت سند ازدواج.
        2ـ معاونت وظيفه عمومي:        (الف) وظيفه عمومي فرم معرفي افراد واجد شرايط جهت دريافت كارت معافيت معلوليت را طراحي و به سازمان بهزيستي ارسال مي‌نمايد.
        (ب) وظيفه عمومي پس از دريافت معرفي‌نامه نسبت به تشكيل شوراي پزشكي اقدام و در صورت واجد شرايط بودن افراد نسبت به صدور كارت معافيت اقدام مي‌نمايد.
        3ـ امور متفرقه:
        الف: انتخاب يك نفر جهت استفاده از معافيت برعهده پدر مشمول و در صورت فقدان با مادر و در غيراينصورت سازمان بهزيستي بعنوان قيم نسبت به انتخاب و معرفي مشمول واجد شرايط اقدام مي‌نمايد.
        ب: كساني كه همسر آنان بعد از ازدواج معلول شده‌اند در شمول مقررات قرار گرفته و از طريق سازمان بهزيستي با ارائه سند ازدواج رسمي و دائم به وظيفه عمومي و پس از تشكيل شوراي پزشكي و احراز نياز به مراقبت @نسبت به صدور كارت معافيت اقدام مي‌شود.
        ج: چنانچه زن معلول يا يكي از بستگان وي از طريق سازمان بهزيستي اثبات نمايند كه همسرش سرپرستي او را رها نموده است، كارت معافيت صادره ابطال و فرد جهت انجام خدمت دوره ضرورت اعزام خواهدشد.
        د: ملاك برخورداري از مقررات فوق وضعيت فرد در زمان احضار قانوني جهت انجام خدمت دوره ضرورت مي‌باشد، لذا كساني كه در زمان غيبت واجد شرايط معافيت شده‌اند رسيدگي به تقاضاي آنان منوط به داشتن عذر موجه براساس ضوابط جاري قانون وظيفه عمومي ‌مي‌باشد.
        هـ : مقررات اعضاء امتيازات ويژه به ايثارگران، قهرمانان ملي، امداد جويان در مورد خانواده‌هاي معلولين به قوت خود باقي است و در چارچوب ضوابط ابلاغي اقدام خواهدشد.
        و: كساني كه مشغول انجام خدمت دوره ضرورت مي‌باشند پس از معرفي وظيفه عمومي مبني بر معافيت فرد، سريعاً از خدمت ترخيص خواهندشد.
        تبصره ـ كاركنان وظيفه مجازند به خدمت خود ادامه داده و كارت پايان خدمت دريافت نمايند ليكن آندسته از كاركنان وظيفه كه علاقمند به استفاده از مقررات فوق باشند با هر ميزان خدمت انجام داده، كارت معافيت دريافت خواهند نمود.
        ز : چنانچه معلولين نيروهاي مسلح متقاضي بهره‌مندي از امتيازات اين قانون باشند بايستي از جانب امور ايثارگران رده خدمتي به سازمان بهزيستي معرفي گردند.`

	t8 := `Absurd: the 19-nation UN committee that accredits human rights NGOs is dominated by regimes that hate human rights, including:
#Burundi
#China
#Cuba
#Iran
#Mauritania
#Nicaragua
#Pakistan
#Russia
#Sudan
#Turkey
#Venezuela
@fuk @miop
At April 16 election, will @UNECOSOC reelect same abusers?`

t9 := `گناه این کودکان در #سوریه چیست چرا دست روی دست می گذارند این قدرتهای بزرگ
#قیام_سراسری #براندازم #ایران 
@lkjo
#😫 #😩
`
	_ = t7
	_ = t6
	_ = t8
	_ = t9
	var res TextParser
	for i := 0; i < b.N; i++ {
		res = ParseText(t9)
	}
	fmt.Println("res: ", res)
}
